xiangjianhe/MonitorPro/code/Project/Header/TPV/PRJ_L_LI2224_1A1D_AUO_M215HTN01_DOT_1.h
//==================================================================
// Version Code of NVRam
//==================================================================
#define _CHECKSUM                                               0x11
#define _VERSION_CODE                                           0x22

//==================================================================
//  For Lenovo Fac Define
//==================================================================
#define _OWNER_NONE                                             0
#define _OWNER_RTK                                              1
#define _OWNER_TPV                                              2
#define _OWNER_FOXCONN                                          3
#define _OWNER_WISTRON       					                4

#define _FACTORY_MODE_OWNER                                     _OWNER_TPV

//==================================================================
//_b0_~_b9_ only for Lenovo Green OSD
//==================================================================
#define _MODEL_NAME                                             _bL_, _bI_, _2_, _2_, _2_, _4_
#define _MICROCODE                                              _bL_,_bA_, _0_, _DOT, _1_

#define _FACTORY_PROJECT_NAME                                   _L,_I,_2,_2,_2,_4
#define _FW_RELEASE_DATE                                        _2,_0,_1,_6,_0,_5,_1,_9
#define _FW_VERSION                                             _L,_A,_0,_DOT,_1
#define _DDCCI_FIRMWARE_VERSION							        0x0001  //Ver 0.07	
#define _IC_SERIES                                      		_R,_T,_D,_2,_2,_8,_1,_E,_L

#define _PANNEL_NAME 											'M','2','1','5','H','T','N','0','1'

//==================================================================
// Digital Port Setting for OSD Input source switch sub menu.
// Description  : The _DVI_PORT,_HDMI_PORT,_DP_PORT,_NONE_PORT defines can't be changed.
//==================================================================
#define _DVI_PORT                                               2//_SOURCE_DVI
#define _HDMI_PORT                                              3//_SOURCE_HDMI
#define _DP_PORT                                                4//_SOURCE_DP
#define _NONE_PORT                                              5//_SOURCE_NONE

#define _INPUT_PORT_MAX                                         2
#define _DIGITAL1_TYPE                                          _DVI_PORT
#define _DIGITAL2_TYPE                                          _NONE_PORT

//--------------------------------------------------
// Definitions for Language Logo setting 
//--------------------------------------------------
#define _NONE_LOGO                                              0
#define _IBM_THINKVISION_LENOVO                                 1
#define _LENOVO                                                 2
#define _LENOVO_THINKVISION										3
#define _LENOVO_THINKVISION_EPA									4
#define _LENOVO_2015                                            5
#define _LENOVO_2015_EPA                                        6

#define _LOGO_TYPE                                              _LENOVO_2015_EPA

#if((_LOGO_TYPE == _IBM_THINKVISION_LENOVO) || (_LOGO_TYPE == _LENOVO))
#define _EPA_LOGO                                               _ON
#endif


#define _AUDIO_ADJUST_FUNCTION_SUPPORT				            _OFF
#define _AUDIO_EXTERNAL_AMP_SUPPORT								_OFF

//==================================================================
// Definitions for Language Type setting 
//==================================================================
#define _8_LAN                                                  0   //_ENGLISH,_FRENCH,_ITALIAN,_CHINESE_S,_SPANISH,_JAPAN,_GERMAN,_RUSSIAN,
#define _2_LAN                                                  1   //_CHINESE_S,_ENGLISH

#define _LANGUAGE_TYPE                                          _8_LAN

//==================================================================
// Definitions for Language default setting
//==================================================================
#define _LANGUAGE_DEFAULT                                        _ENGLISH

//==================================================================
// Definitions for Panel Contrast
//==================================================================
#define _COLOR_TEMP_DEF                                         _CT_6500

//#define MAX_CONTRAST_RATIO                                      118 // 1.75(unit 1/100)
//#define DEF_CONTRAST_RATIO                                      101 // 1.00(unit 1/100)
//#define MIN_CONTRAST_RATIO                                      40//15  // 0.5(unit 1/100)

#define MAX_CONTRAST_TO_REG_VALUE             118
#define MIN_CONTRAST_TO_REG_VALUE              40
#define DEF_CONTRAST_TO_REG_VALUE               100
 
#define MAX_CONTRAST_TO_INTERNET_VALUE  118
#define MIN_CONTRAST_TO_INTERNET_VALUE   40
#define DEF_CONTRAST_TO_INTERNET_VALUE    100
 
#define MAX_CONTRAST_TO_VIDEO_VALUE                  118
#define MIN_CONTRAST_TO_VIDEO_VALUE                   40
#define DEF_CONTRAST_TO_VIDEO_VALUE             100
 
#define MAX_CONTRAST_TO_SPLIT_VALUE           118
#define MIN_CONTRAST_TO_SPLIT_VALUE            40
#define DEF_CONTRAST_TO_SPLIT_VALUE             100

#define _OSD_CONTRAST_DEF_VALUE                                 50
#define _OSD_BRIGHTNESS_DEF_VALUE                               50

#define _OSD_BRIGHTNESS_WEB_VALUE                               70
#define _OSD_CONTRAST_WEB_VALUE                                 60  

#define _OSD_BRIGHTNESS_VIDEO_VALUE                             90
#define _OSD_CONTRAST_VIDEO_VALUE                               65  

#define _OSD_BRIGHTNESS_SPLIT_VALUE                             90
#define _OSD_CONTRAST_SPLIT_VALUE                               65  

#define _LOW_BLUE_LIGHT_FUNCTION                                _ON

#if(_LOW_BLUE_LIGHT_FUNCTION == _ON)
#define _LBL_BRIGHTNESS_DEF_VALUE                       		10//40
#define _LBL_CONTRAST_DEF_VALUE                                 _OSD_CONTRAST_DEF_VALUE    


#endif

