xiangjianhe/MonitorPro/code/Project/Header/TPV/PRJ_L_LI2224_1A1D_AUO_M215HTN01_DOT_1.h
//==================================================================
// Brightness PWM Table
//==================================================================
#define _PWM_B00                                                88//0x58 //|00
#define _PWM_B10                                                109//0x58 //|10
#define _PWM_B20                                                141//0x5B //|20
#define _PWM_B30                                                157//0x63 //|30
#define _PWM_B40                                                180//0x6D //|40
#define _PWM_B50                                                203//0x7B //|50
#define _PWM_B60                                                214//0x8D //|60
#define _PWM_B70                                                225//0xAC //0x9A //|70
#define _PWM_B80                                                236//0xCB //0xBF //|80
#define _PWM_B90                                                247//0xE5 //0xDE //|90
#define _PWM_B100                                               0xFF //|100

#define MIN_BACKLIGHT_PWM                                       _PWM_B00
//-----------------------------------------------------------------------------------------------------------
#if((_PWM_B50>_PWM_B60)||(_PWM_B60>_PWM_B70)||(_PWM_B70>_PWM_B80)||(_PWM_B80>_PWM_B90)||(_PWM_B90>_PWM_B100))
  #error: PWM data error!!!
#endif

//==================================================================
// Definitions of OOR Dclk Auto Adjust
//==================================================================
#define OOR_DCLK_CHECK                                  		_ON

//==================================================================
// Definitions of _VGA_CHROMA_PATTERN12_SUPPORT
//==================================================================
#define _VGA_CHROMA_PATTERN12_SUPPORT                           _ON

//==================================================================
// COLOR TEMP DEFAULT DATA
// Definitions Colortemp RGB value for each project
//==================================================================
#define _CT7200_LenovoPrj_RED                                   119
#define _CT7200_LenovoPrj_GREEN                                 125
#define _CT7200_LenovoPrj_BLUE                                  127

#define _CTSRGB_LenovoPrj_RED                                   126
#define _CTSRGB_LenovoPrj_GREEN                                 128
#define _CTSRGB_LenovoPrj_BLUE                                  125

#define _CT6500_LenovoPrj_RED                                   128
#define _CT6500_LenovoPrj_GREEN                                 128
#define _CT6500_LenovoPrj_BLUE                                  128

#define _CT9300_LenovoPrj_RED                                   105
#define _CT9300_LenovoPrj_GREEN                                 113
#define _CT9300_LenovoPrj_BLUE                                  128

#define _CTUSER_LenovoPrj_RED                                   128
#define _CTUSER_LenovoPrj_GREEN                                 128
#define _CTUSER_LenovoPrj_BLUE                                  128

#if(_LOW_BLUE_LIGHT_FUNCTION == _ON)

#define _CTLOWBLUELIGHT_RED                                     128
#define _CTLOWBLUELIGHT_GREEN                                   128
#define _CTLOWBLUELIGHT_BLUE                                    100

#endif

//-------------------------------------------------
//define Audio
//-------------------------------------------------
#define _AUDIO_ADJUST_FUNCTION_SUPPORT				            _OFF
#define _AUDIO_EXTERNAL_AMP_SUPPORT								_OFF
#define _ANALOG_VOLUME_MUTE										0x0000

//==================================================================
// Fine tuning OSD H position by pixel
//==================================================================
#define _OSD_POSITION_FONT_A_H_DELAY_                           1

//==================================================================
// Panel VCOM Function
//==================================================================
#define _PANEL_VCOM_ADJUST_FUNCTION						        _OFF

//-------------------------------------------------
//Definitions for panel backlight PWM ferq.
//-------------------------------------------------
#define _PWMFREQIVF                                             0
#define _PWMFREQ20K                                             1
#define _PWMFREQ22K                                             2

#define _BACKLIGHT_PWM_FREQ_SELECT                              _PWMFREQ20K

//==================================================================
// Auot Power Down Function
//==================================================================
#define _AUTO_POWER_DOWN                                        _OFF

//-------------------------------------------------
// OD Support Define  
//-------------------------------------------------

#define _OD_OSD_SUPPORT                                         _OFF

//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
// Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------

#endif // End of #if(_PROJECT == _PRJ_L_LS2014_A)

